{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "batch_input_shape": [null, 96, 96, 1], "scale": true, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "dtype": "float32", "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 24, "name": "conv2d_1", "kernel_size": [5, 5], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "batch_input_shape": [null, 96, 96, 1], "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv2d_2", "kernel_size": [5, 5], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "filters": 36, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv2d_3", "kernel_size": [5, 5], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "filters": 48, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv2d_4", "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 500, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dense", "config": {"name": "dense_2", "units": 30, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}}], "keras_version": "2.0.4", "backend": "tensorflow"}